{
  "backend/main.mo": "Main backend actor implementing deposit transactions with multi-currency support and 20% tax calculation, user profiles, winning records, M-PESA payment integration (paybill 400004), and access control with admin/user permissions.",
  "feature_evidence.json": "Feature evidence report documenting five authentication UX improvements: inline authentication prompts, automatic login persistence, one-click login flow, loading indicators, and prominent LoginButton styling with Betika green colors.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including profile management, deposit interface with tax calculation, transaction history, betting history, phone verification for 16 African countries, and Betika green theme integration.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes, including custom Betika green theme colors and sidebar styling.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Betika Casino' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup, Layout component featuring sticky header with Betika green gradient logo, authentication-aware UserMenu/LoginButton toggle, and routes for admin and games pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Inline authentication banner using Alert component with prominent 'Sign In Securely' button, loading states, and three feature highlight cards explaining secure authentication, payout management, and transaction tracking.",
  "frontend/src/components/AdminFundsReleaseSection.tsx": "Admin component for managing pending winner payouts with tax calculation (20%), displaying gross/net amounts, and releasing winnings to users via M-PESA with confirmation dialogs.",
  "frontend/src/components/BalanceCard.tsx": "Empty file with no content.",
  "frontend/src/components/BettingHistorySection.tsx": "Empty file with no content.",
  "frontend/src/components/DataTable.tsx": "Reusable table component that renders data with configurable columns, custom formatters, and handles empty states.",
  "frontend/src/components/DepositSection.tsx": "Multi-currency deposit component supporting 9 currencies with exchange rate conversion to KES, 20% tax calculation, M-PESA payment instructions, and transaction tracking.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity that handles login/logout with loading states and error recovery.",
  "frontend/src/components/MemberCountCard.tsx": "Empty file with no content.",
  "frontend/src/components/PersonalInfoSection.tsx": "Empty file with no content.",
  "frontend/src/components/PhoneVerificationModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileHeader.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileTabs.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsSection.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionHistorySection.tsx": "Empty file with no content.",
  "frontend/src/components/UserMenu.tsx": "Dropdown menu component displaying user profile with avatar, principal ID, and logout functionality with disabled profile/admin links.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with Internet Identity authentication, admin token initialization, and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for deposits, user profiles, and admin fund releases with mock data for pending winners and release history.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including a Betika green color scheme and utility classes for brand colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with access control that displays fund release management, release history with tax calculations (20%), and summary statistics for authenticated admin users.",
  "frontend/src/pages/GamesPage.tsx": "Games management page with admin-only access that displays placeholder statistics for total games, active bets, wins, and revenue.",
  "frontend/src/pages/ProfilePage.tsx": "Empty profile page component with no implementation.",
  "frontend/src/utils/phoneValidation.ts": "Empty phone validation utility file with no implementation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a BETIKA-like betting and casino app with multi-currency support, M-PESA integration (paybill 400004), 20% tax on stakes/withdrawals, and features including user profiles, phone verification, payment deposits/withdrawals, casino games, live games, and jackpots. Contains architectural notes, known issues (difficult login flow), and a comprehensive list of implemented features with their requirement IDs."
}