{
  "backend/main.mo": "Main actor defining deposit transactions with multi-currency support (9 African currencies), winning records, M-PESA paybill integration (400004), exchange rate conversion to KES, and admin/user role-based access control for deposit confirmation and payout operations.",
  "backend/migration.mo": "Migration module defining old and new actor types to remove the userProfiles map while preserving transactions, winningRecords, and nextTransactionId state during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting removal of profile-related frontend components, routes, React Query hooks, phone validation utilities, and UI cards across multiple test requirements (REQ-36 through REQ-40).",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx (admin-only routing), profile components (header, tabs, sections), deposit interface with M-PESA paybill 400004, phone verification for 16 African countries, and React Query hooks for deposit/admin operations.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining Betika green theme colors and comprehensive design tokens for light and dark modes including sidebar, chart, and UI component variables.",
  "frontend/index.html": "HTML entry point for the Betika Casino application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router configuration defining root, index, and admin routes all rendering AdminPage component with Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a lock icon, restricted access message, and Internet Identity login button with loading state for unauthenticated users.",
  "frontend/src/components/AdminFundsReleaseSection.tsx": "Admin component displaying pending winner payouts with user details, amounts in KES, win dates, and confirmation dialog for releasing winnings with success/error toast notifications.",
  "frontend/src/components/BalanceCard.tsx": "Empty file (no content provided).",
  "frontend/src/components/BettingHistorySection.tsx": "Empty file (no content provided).",
  "frontend/src/components/DataTable.tsx": "A reusable table component that renders data in a table format with configurable columns, supporting custom formatting and displaying a message when no data is available.",
  "frontend/src/components/DepositSection.tsx": "Handles deposit initiation with multi-currency support, calculates exchange rates to KES, displays M-PESA payment instructions (Paybill 400004, Account 0116828013), and manages deposit confirmation flow.",
  "frontend/src/components/MemberCountCard.tsx": "Empty file with no content.",
  "frontend/src/components/PersonalInfoSection.tsx": "Empty file with no content.",
  "frontend/src/components/PhoneVerificationModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileHeader.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileTabs.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsSection.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionHistorySection.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Manages backend actor creation with Internet Identity authentication, initializes access control with admin token from URL params, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient configuration with delegation identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for deposit operations (initiate/confirm), admin fund release management (pending winners, release history), and admin role verification using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes, including Betika green brand colors and utility classes for styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that verifies admin access, displays fund release management interface with summary cards (holding account, pending payouts, total released), and shows release history in a data table.",
  "frontend/src/pages/ProfilePage.tsx": "Empty file with no content.",
  "frontend/src/utils/phoneValidation.ts": "Empty file with no content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space (including Betika green branding), container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document for a Betika-like betting and casino app, listing implemented features including user profiles, authentication, phone verification, payment deposits, and architectural notes about multi-currency support and M-PESA integration."
}