{
  "backend/main.mo": "Main backend actor implementing user profiles, multi-currency deposit transactions (9 African currencies), winning records, access control with admin/user permissions, and balance management with M-PESA paybill 400004.",
  "backend/migration.mo": "Migration module that transforms old deposit transactions (single currency) to new multi-currency format, defaulting existing transactions to KES and updating paybill to 400004.",
  "feature_evidence.json": "Feature evidence report documenting implementation of pan-African phone validation, currency selection for deposits, and multi-currency support across frontend components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including profile management, deposit interface with 9 African currencies, phone verification for 16 African countries, and admin functionality.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining Betika green theme colors and CSS variables for light/dark modes.",
  "frontend/index.html": "HTML entry point for the Betika Casino application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for profile, admin pages, and global Toaster component.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen with Internet Identity login button displayed to unauthenticated users attempting to access protected content.",
  "frontend/src/components/AdminFundsReleaseSection.tsx": "Admin interface for viewing pending winner payouts and releasing winnings with confirmation dialog, showing user details, amounts in KSh, and win dates.",
  "frontend/src/components/BalanceCard.tsx": "Displays user account balance in KSh with a wallet icon in a gradient green card. Formats bigint balance values with locale-specific number formatting.",
  "frontend/src/components/BettingHistorySection.tsx": "Shows betting history with summary cards (total staked, won, net profit) and a data table of recent bets. Uses mock data for game types, stakes, outcomes, and timestamps.",
  "frontend/src/components/DataTable.tsx": "Generic reusable table component that renders data with configurable columns and optional formatting functions. Displays empty state when no data is available.",
  "frontend/src/components/DepositSection.tsx": "Handles multi-currency deposits with M-PESA integration, showing paybill/account details and exchange rate calculations. Supports 9 currencies (KES, USD, EUR, GBP, UGX, TZS, MWK, ZAR, ZMW) with conversion to KES.",
  "frontend/src/components/MemberCountCard.tsx": "Displays total registered member count in a gradient green card with loading skeleton and error handling. Fetches data using useGetTotalMemberCount hook.",
  "frontend/src/components/PersonalInfoSection.tsx": "Displays user profile information (username, email, wallet address, member since date) in a card with icons. Shows empty state when no profile data is available.",
  "frontend/src/components/PhoneVerificationModal.tsx": "Modal for 6-digit SMS verification code entry with resend functionality and countdown timer. Handles phone verification and resend mutations with toast notifications.",
  "frontend/src/components/ProfileHeader.tsx": "Profile page header with banner background, avatar, user info, balance card, and action buttons (admin access if authorized, logout). Uses gradient overlay and responsive layout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for initial user profile setup that collects username, email, wallet address, and phone number with real-time African phone number validation and triggers phone verification flow upon submission.",
  "frontend/src/components/ProfileTabs.tsx": "Tabbed interface component that organizes profile sections (Personal Info, Deposit, Betting History, Transactions, Settings) with responsive icons and labels.",
  "frontend/src/components/SettingsSection.tsx": "Settings form component that allows users to update their username, email, and wallet address with validation and mutation handling.",
  "frontend/src/components/TransactionHistorySection.tsx": "Displays transaction history in a data table with support for deposits, withdrawals, and winnings, showing original currency amounts and KES equivalents with payment method details.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, deposit initiation/confirmation, member count retrieval, phone verification, and admin fund release with mock implementations for some features.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, including Betika green brand colors and utility classes for styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with access control, displaying fund release management interface, summary cards, and release history table for authorized administrators.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page that handles authentication, profile setup, phone verification, and displays user profile information with tabs and member count.",
  "frontend/src/utils/phoneValidation.ts": "Pan-African phone number validation utilities supporting 16+ African countries with carrier detection, country detection, and phone number formatting functions.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities for extracting, storing, and managing query parameters from both regular and hash-based routing with sessionStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (including Betika green theme), container settings, animations, and extended theme properties using OKLCH color space.",
  "project_state.json": "Project state file tracking a BETIKA-like betting/casino app with phone authentication, M-PESA payments (paybill 400004), multi-currency support, and user profile features. Contains 24 existing features including phone verification, payment deposits/withdrawals, user registration analytics, and pan-African phone number validation."
}