{
  "backend/main.mo": "Main actor implementing deposit transactions with 20% tax calculation, winning records, user profiles, currency conversion, and admin/user authorization using access control and migration logic.",
  "backend/migration.mo": "Migration module that transforms old deposit transactions to new format by adding a taxAmount field calculated as 20% of the converted KES amount.",
  "feature_evidence.json": "Feature evidence report documenting three completed features for displaying tax breakdowns in DepositSection, AdminFundsReleaseSection, and admin release history table.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of frontend components including DepositSection with 20% tax calculation display and various profile/admin management components.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode variables for Betika green theme and UI components.",
  "frontend/index.html": "HTML entry point for the Betika Casino application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for AdminPage and rendering Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying login prompt with Internet Identity authentication button for unauthenticated users.",
  "frontend/src/components/AdminFundsReleaseSection.tsx": "Admin component displaying pending payouts with 20% tax breakdown showing gross amount, tax deduction, and net payout with release confirmation dialog.",
  "frontend/src/components/BalanceCard.tsx": "Component displaying user's account balance in KSh with green gradient background and wallet icon (content truncated in source).",
  "frontend/src/components/BettingHistorySection.tsx": "Component showing betting history with summary cards and data table of bets (content truncated in source).",
  "frontend/src/components/DataTable.tsx": "Reusable table component with customizable columns, optional formatting functions, and empty state handling for displaying tabular data.",
  "frontend/src/components/DepositSection.tsx": "React component for initiating deposits with multi-currency support, M-PESA payment instructions, tax calculations (20%), and exchange rate conversions to KES.",
  "frontend/src/components/MemberCountCard.tsx": "Empty file with no content.",
  "frontend/src/components/PersonalInfoSection.tsx": "Empty file with no content.",
  "frontend/src/components/PhoneVerificationModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileHeader.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileTabs.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsSection.tsx": "Empty file with no content.",
  "frontend/src/components/TransactionHistorySection.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages backend actor creation with Internet Identity authentication, handles admin token initialization, and invalidates dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for deposit operations (initiate/confirm), admin fund release management (pending winners, release history), and admin role verification with mock data implementations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, Betika green brand colors, and utility classes for consistent styling across the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with access control, displaying fund release management interface, release history table with tax calculations, and summary cards for holding account information.",
  "frontend/src/pages/ProfilePage.tsx": "Empty file with no content.",
  "frontend/src/utils/phoneValidation.ts": "Empty file with no content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including OKLCH color space), container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting a BETIKA-like betting/casino app with existing features including user profiles, authentication, phone verification, payment deposits, M-PESA integration (paybill 400004), multi-currency support, and 20% tax deductions."
}