{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify login flow and improve user experience",
  "requirements": [
    {
      "id": "REQ-54",
      "summary": "Replace AccessDeniedScreen with inline authentication prompt allowing content visibility",
      "acceptanceCriteria": [
        "Users can view application content without being completely blocked by AccessDeniedScreen",
        "A prominent, non-intrusive sign-in prompt is displayed for unauthenticated users",
        "The sign-in prompt clearly explains the benefits of logging in and has a single-click Internet Identity button"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Convert AccessDeniedScreen from a full-page blocking component to an inline banner or modal overlay component that displays prominently but allows underlying content to remain visible. Add clear messaging about benefits of signing in and include a streamlined Internet Identity login button."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update App.tsx to render the modified inline authentication prompt component for unauthenticated users while still displaying page content underneath. Ensure the authentication prompt is visible across all routes but does not block interaction with public content."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Ensure AdminPage continues to properly gate admin-only content while allowing the inline authentication prompt to appear for non-admin users attempting access."
        },
        {
          "path": "frontend/src/pages/GamesPage.tsx",
          "operation": "modify",
          "description": "Ensure GamesPage properly handles authentication state and displays the inline prompt for unauthenticated users while showing available game content to guests."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Add automatic login persistence for returning users with active Internet Identity sessions",
      "acceptanceCriteria": [
        "Users with active Internet Identity sessions are automatically authenticated on page load",
        "No manual login action is required for users with valid sessions",
        "The authentication check happens silently in the background during app initialization"
      ],
      "file_operations": [
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Add silent authentication check during app initialization that attempts to restore existing Internet Identity sessions automatically. This should happen before the main app content renders, checking for valid delegations and automatically logging in users with active sessions without requiring manual interaction."
        },
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "modify",
          "description": "Update LoginButton to properly reflect auto-login state during initialization and show appropriate loading indicators while the silent authentication check is in progress."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Implement one-click login flow that immediately opens Internet Identity authentication",
      "acceptanceCriteria": [
        "Clicking the sign-in button immediately opens Internet Identity authentication",
        "No intermediate confirmation dialogs or additional steps are required",
        "The login flow completes in a single user action after Internet Identity authentication"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "modify",
          "description": "Streamline the login handler to immediately invoke Internet Identity authentication when clicked, removing any intermediate steps or confirmation dialogs. Ensure the login() function from useInternetIdentity is called directly without additional UI prompts."
        },
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Update the sign-in button in the inline authentication prompt to use the same one-click flow, immediately opening Internet Identity when clicked without intermediate steps."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Add clear visual feedback with loading indicators during authentication",
      "acceptanceCriteria": [
        "A loading spinner or progress indicator appears when login is initiated",
        "Status messages indicate authentication is in progress",
        "Users receive immediate feedback when authentication succeeds or fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "modify",
          "description": "Add loading spinner and status text that appears immediately when login is initiated. Display 'Authenticating...' or similar message during the login process. Show success/failure feedback with appropriate icons and messages based on authentication result."
        },
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Add loading states and visual feedback to the inline authentication prompt's sign-in button, showing spinners and status messages during the authentication process to provide clear user feedback."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Update LoginButton in App.tsx header with prominent styling and actionable text",
      "acceptanceCriteria": [
        "Login button is visually distinct and immediately noticeable in the header",
        "Button uses Betika green brand colors for strong visual emphasis",
        "Button text clearly communicates the action and benefit of signing in"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "modify",
          "description": "Increase button size with larger padding and font-size. Apply Betika green brand colors (betika-green-500 for background, betika-green-600 for hover state) for strong visual emphasis. Change button text from 'Login' to 'Sign In to Play' to communicate the action and benefit. Add pulse animation or glow effect to draw attention."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the LoginButton in the header has sufficient spacing and positioning to be immediately noticeable. Verify the button is prominently displayed and not overshadowed by other header elements."
        }
      ]
    }
  ]
}