{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement 20% tax deduction on staked and withdrawal amounts",
  "requirements": [
    {
      "id": "REQ-45",
      "summary": "Update the DepositSection component to display tax breakdown showing deposited amount, 20% tax deduction, and net amount available for staking",
      "acceptanceCriteria": [
        "Deposit interface shows gross deposit amount entered by user",
        "Tax amount (20% of deposit) is displayed clearly",
        "Net amount available for staking (80% of deposit) is prominently shown",
        "Tax breakdown appears before user confirms the deposit"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DepositSection.tsx",
          "operation": "modify",
          "description": "Add tax calculation logic that computes 20% tax on the KES amount after currency conversion. Display a breakdown showing: original deposit amount in selected currency, converted KES amount, 20% tax deduction, and net amount (80%) available for staking. Include this breakdown in both the deposit form preview and the M-PESA payment instructions dialog. Format all KES amounts using the existing number formatting utilities."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Update the AdminFundsReleaseSection component to display tax breakdown for each payout showing winning amount, 20% tax deduction, and net payout amount",
      "acceptanceCriteria": [
        "Admin interface shows gross winning amount for each pending payout",
        "Tax amount (20% of winnings) is displayed clearly",
        "Net payout amount (80% of winnings) is shown as the amount to be released",
        "Confirmation dialog includes tax breakdown before releasing funds"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminFundsReleaseSection.tsx",
          "operation": "modify",
          "description": "Add tax calculation logic that computes 20% tax on winning amounts. Update the pending winners display to show three values for each winner: gross winning amount, 20% tax deduction, and net payout amount (80% of winnings). Modify the release confirmation dialog to include a detailed tax breakdown showing these three values before the admin confirms the release. All amounts should be displayed in KES with proper formatting."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Update the release history data table in the admin interface to include tax amount and net payout columns for all completed fund releases",
      "acceptanceCriteria": [
        "Release history table shows gross winning amount column",
        "Tax amount column displays 20% deduction for each release",
        "Net payout column shows the actual amount released to the user",
        "All amounts are displayed in KES with proper formatting"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Update the release history DataTable configuration to include three amount columns: gross winning amount, tax amount (20%), and net payout amount (80%). Add column definitions for 'Gross Amount', 'Tax (20%)', and 'Net Payout' with proper KES formatting. Ensure the table properly displays these calculated values for all historical fund releases retrieved from the backend."
        }
      ]
    }
  ]
}